[
{"name": "Umang shah", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/umang-shah", "education": ["PDP Programme, Aalto University, Finland"], "email": "umang_shah@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "a.", " Integrated Interdisciplinary Design ", "b.", " Design and Technology ", "c.", " Aesthetic Detailings and Manufacturing ", "d.", " Radical and Incremental Innovation.", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Troy vasanth", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/troy-vasanth", "education": ["PGDPD (Animation Film Design), NID, Ahmedabad"], "email": "troy_vasanth@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Sound Design, 3D, Animation and Motion Design", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Swati priya", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/swati-priya", "education": ["PhD (Heavy Metal Detection in Crops and Soil Clay Mineral Abundance Mapping using Hyperspectral Data),  DA-IICT Gandhinagar"], "email": "swati_priya@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Remote sensing and GIS, Precision agriculture, and Crop modelling precision agriculture", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Subhas chandra nandy", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/subhas-chandra-nandy", "education": ["PhD (Computer Science), University of Calcutta "], "email": "subhas_nandy@dau.ac.in", "phone": "079-68261717", "address": "# 4105, FB-4, DAU, Gandhinagar, Gujarat, India – 382007", "faculty_web": null, "biography": ["Subhas C Nandy received the M.Sc. degree in Statistics from University of Calcutta in the year 1982, M.Tech.(CS) degree from Indian Statistical Institute in the year 1985, and Ph.D. degrees in Computer Science from University of Calcutta in the year 1996. Since 1986, he was an employee of Indian Statistical Institute, Kolkata. He retired as Professor HAG in July 2024. At the time of retirement he was attached with the Advanced Computing and Microelectronics Unit of the institute. He held visiting scientist positions in Japan Advance Institute of Science and Technology (JAIST) during 1998-1999 and City University of Hong Kong during May-August 2000. During August-December 2014 and August-September 2015, he served Carleton University as a visiting professor. He served in the Programme Committee of ISAAC (2006,2022), FSTTCS (2006, 2014), WALCOM (2008, 2010, 2011,2015, 2017, 2018, 2021, 2024, 2025, 2026). He is the Steering Committee member of the Workshop on Algorithms and Computation (WALCOM). He also served as a Guest Editor of two issues of the journal Theoretical Computer Science, and the special issue of WALCOM 2021 in J. on Graph Algorithms and Applications. He supervised 7 Doctoral students and more than 30 M.Tech.(CS) students during the tenure of his service as a faculty member in ISI.", "The research areas of interest of Dr. Nandy are computational and combinatorial geometry and algorithmic graph theory with applications in VLSI physical design, wireless communication, robot path planning, etc. He collaborates with researchers in IIT KGP, IIT Guwahati, IIT Delhi, etc. in the country, and Carleton University, Simon Fraser University, abroad. He published more than 100 research articles in reputed international journals and peer reviewed conferences."], "specialization": ["\n                    ", "\n          ", "Algorithms, Data Structure, Graph Applications, Computational and Combinatorial Geometry", "\n\n            \n                  "], "teaching": ["\n                    \n            ", "Algorithms, Data Structure, Computational Geometry, Graph Algorithms, Optimization, Approximation and Randomized Algorithms", "\n", "\n        \n                  "], "publications": [], "research": []},
{"name": "Samit bhattacharya", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/samit-bhattacharya", "education": ["PhD (Computer Science & Engineering), IIT Kharagpur"], "email": "samit_bhattacharya@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Extended reality (virtual, augmented & mixed reality)", "\n\t", "Affective & ubiquitous systems", "\n\t", "Mobile & wearable systems & interactions", "\n\t", "ICT applications in education, agriculture, & healthcare", "\n\t", "User-Centric Computing & Human-computer interaction", "\n", "\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Rudranil das", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/rudranil-das", "education": ["Post Graduate Diploma in Textile Design, National Institute of Design (NID), Ahmedabad"], "email": "rudranil_das@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Photography, Traveling, Research & Documentation on various crafts", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Prosenjit ganguly", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/prosenjit-ganguly", "education": ["4yr Diploma (now B.Des) in Animation Film Design, NID"], "email": "prosenjit_ganguly@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Animation Film Making, Screenwriting, Story-telling, Character Design, Photography, Illustration, Voice Acting", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Prashant grover", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/prashant-grover", "education": ["B.Sc (Hons) - Animation & Multi., Birla Institute of Technology "], "email": "prashant_grover@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": ["I am a Artist professionally working in this industry for past 11 years. I am specialized in Motion graphics Animation Compositing, character design and storyboarding. I thrive on learning new things everyday and make an effort to explore different aspects of a job just to be more versatile."], "specialization": ["\n                    ", "\n          ", "Animation", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Parth mehta", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/parth-mehta", "education": ["PhD (Information and Communication Technology), DA-IICT Gandhinagar"], "email": "parth_mehta@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Natural Language Processing, Large Language Models, Information Retrieval, Deep Learning", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Nikita desai", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/nikita-desai", "education": ["PhD (Design), DA-IICT Gandhinagar"], "email": "nikita_d@dau.ac.in", "phone": "+91 9825169337", "address": null, "faculty_web": null, "biography": ["I received my M.Des and Ph.D from DAIICT, and have been teaching courses as an adjunct faculty with the M.Des program since 2017. I am also the Co-Founder and Creative Technology Director of Myth Interactives, a design agency specializing in the creation of Interactive and Immersive Experiences for Cultural Spaces since 2009."], "specialization": ["\n                    ", "\n          ", "Interaction Design Immersive Experience Design", "\n\n            \n                  "], "teaching": ["\n                    \n            ", "Principles of Interaction Design", "\n\t", "Web Design: Applications, Inter-connectibility", "\n", "\n        \n                  "], "publications": ["A Different Freedom: Kite Flying in Western India; Culture and Tradition ; published by Cambridge Scholars Publishing, UK in 2010. ISBN-10: 1443822736", "Presentation on “ National Consortium of Tribal Arts and Culture ”, International Conference on Indigenous Peoples in the Post-Colonial World, IGNCA, New Delhi, January 2008", "Presentation on “ Interactive Museums ”, Autumn School, Indian Institute of Advanced Studies, Shimla, November 2008", "Presentation on “ Museums and Interactive Design ”, International Conference on Nomadic Communities in the Post-Colonial World, Tejgadh, January 2009", "Paper on “ Documenting Vanishing Traditions: The National Consortium of Tribal Arts and Culture ”, National Seminar on Vanishing Traditions and Livelihood Systems, KIRTADS, Calicut, December 2009", "Paper on “ Fatehgunj and Sayajirao: The formation of cosmopolitan spatial identities within Baroda ”, 5th Biennial Conference on (Re)Defining Gujarati Identity, Gujarat Studies Association, Ahmedabad, February, 2014", "Paper on “ Home, Neighbourhood and City: Changing residential spaces in Baroda ”, International Conference on Reinventing Design Pedagogy And Contextual Aesthetics, NIT, Calicut. January 2015."], "research": ["\n                    \n            ", "Interactive Space Design Immersive Technologies and Strategy Communication, Space, and Design", "\n", "\n        \n                  "]},
{"name": "Nandini banerjee", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/nandini-banerjee", "education": ["MA, M.Phil, PhD (International Economics), MA psychology in Psychotherapy and Counselling"], "email": "nandini_banerjee@dau.ac.in", "phone": "079-68261620", "address": "# 2110, FB-2, DA-IICT, Gandhinagar, Gujarat, India – 382007", "faculty_web": null, "biography": ["I have done MPhil, PhD in Economics. with specialization in ” India ASEAN Trade Relations.”", "I have also done MA in Psychology. Have 23+ years of Teaching and Counselling experience. I have worked in different projects in TISS Mumbai.", "Have conducted workshops, sessions in Stress Management, Guided Meditation, Self-Grooming and preparing students for placement for HR interviews, Emotional Intelligence, 6 Thinking Hats. Work as Psychotherapist and Counselling Psychologist.", "I am a passionate learner, having good communication skills, Peoples skill and problem solving skills."], "specialization": ["\n                    ", "\n          ", "Economics, Psychology, Soft skills.", "\nCertifications in Basic counseling course – Counseling development program (CDP), Advanced counseling course (ADP), Theoretical and experiential training on Fundamentals of Cognitive Behavior Therapy (CBT), Emotional Freedom Therapy (EFT), Reiki level I and II, by Reiki Grandmaster, Interactive meditation workshop, Hypnotherapy.", "\n\n", "Broad Area of Research Work", "\n\n", "Marketing Psychology", "\n\t", "Spiritual Psychology", "\n\t", "Psychological Abnormalities", "\n\t", "Engineering Psychology", "\n\t", "Neuro Economics", "\n", "\n            \n                  "], "teaching": ["\n                    \n            ", "Organization Behavior", "\n\t", "Human Behavior Management", "\n\t", "Soft Skills", "\n\t", "Economics", "\n", "\n        \n                  "], "publications": ["Attended conference on Mental Health and presented a paper in January 2021."], "research": []},
{"name": "Kuntala dasgupta", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/kuntala-dasgupta", "education": ["BSc, Calcutta University"], "email": "sdg.dau@gmail.com", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Rabindra Sangeet, North Indian, Classical, India Film Music and History", "\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Kripabandhu ghosh", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/kripabandhu-ghosh", "education": [], "email": "kripaghosh@iiserkol.ac.in", "phone": null, "address": "Department of Computational and Data Sciences,", "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Information Retrieval/Data Mining/AI on Legal Domain", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Kalgi gandhi", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/kalgi-gandhi", "education": ["PhD - Thesis Submitted, DA-IICT Gandhinagar"], "email": "kalgi_gandhi@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Database Management, Distributed Database Management, Edge Computing", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "K narayana chandran", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/k-narayana-chandran", "education": ["PhD, Indian Institute of Technology Bombay"], "email": "knarayana_chandran@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Major Areas of Specialization:", "\n\n", "English Poetry and Theory; English Pedagogy and Politics of the discipline; Indian and western narrative traditions", "\n\n", "Minor Specialization:", "\n\n", "Translation; Allusion, intertextuality and intergenres; Short Narrative Forms including short fiction; Reading Relations ...", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Jayprakash lalchandani", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/jayprakash-lalchandani", "education": ["PhD (Computer Science), IIT Kharagpur"], "email": "jayprakash_lalchandani@dau.ac.in", "phone": "079-68261610", "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Software Engineering", "\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Gangeya mukherji", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/gangeya-m", "education": ["PhD (The Vision of India in Tagore and Vivekananda), University of Allahabad"], "email": "gangeya_mukherji@dau.ac.in", "phone": "079-68261683", "address": null, "faculty_web": null, "biography": ["Gangeya Mukherji took his doctorate degree from the University of Allahabad, on Vivekananda and Tagore, subsequent to the award of a Junior Research Fellowship from the University Grants Commission of India. He taught English Literature at a liberal arts college for 32 years before opting for early retirement in 2021. He was a Fellow at the Indian Institute of Advanced Study, Shimla (2008-2010), and Sabarmati Ashram Preservation and Memorial Trust (May-June 2017); and a Visiting Professor at the School of Arts and Sciences, Ahmedabad University (2018). Interested in the history of ideas with a particular focus on nineteenth and twentieth-century India, Mukherji specialises in Intellectual history, with a particular focus on capacious concepts, the imagining of modern India, Vivekananda, Tagore, Gandhi, Post Colonialism, and the Mahabharata. His books, published internationally, have been credited with generous reviews by some of the leading experts in the field. He served as the Convener of the International Seminar on “Exploring NonViolence” organised at the Indian Institute of Advanced Study, Shimla, from October 20-22, 2008; the International Seminar on “The Home and the World: Rabindranath Tagore” sponsored by Ministry of Culture, Government of India, and organised at the Indian Institute of Advanced Study, Shimla, during November 14-16, 2011, the Joint Coordinator of the Summer School on “Exploring Agency in the Mahabharata: Ethical, Political and Dharmic” organised at the Indian Institute of Advanced Study, Shimla, during September 17-30, 2012, and the Coordinator of the Winter School on “Life and Thought of Gandhi” organised at the Indian Institute of Advanced Study, Shimla, from December 1-15, 2016."], "specialization": ["\n                    ", "\n          ", "Intellectual history, 19th century India, Post-colonialism, Vivekananda, Tagore, Gandhi, Mahabharata.", "\n\n            \n                  "], "teaching": [], "publications": ["Gandhi and Tagore: Politics, Truth, and Conscience, Oxon; Delhi: Routledge, 2016.", "An Alternative Idea of India: Tagore and Vivekananda, London; Delhi: Routledge, 2011.", "Learning Non-Violence, Delhi: Oxford University Press, 2016.", "Exploring Agency in the Mahabharata: Ethical and Political Dimensions of Dharma, co-edited with Sibesh Chandra Bhattacharya & Vrinda Dalmiya, Oxon; Delhi: Routledge, 2018.", "‘The Schema of the Vow: Individuality and Dharma in Mahabharata’ in Indian Ethics and the Human Condition -- In Search of Answers, Kolkata: Ramakrishna Mission Institute of Culture (forthcoming).", "‘Yakshaprasna and Yudhishthira: A Conversation on Dharma and Ethics’, in Balaganapathi Deverakonda, et al., (eds), Dialoguing with Timeless Text: Revisiting the Mahabharata, Delhi: Motilal Banarasidass Publishing House (forthcoming).", "‘Gandhi: Calling to non-violence joined by a strong pragmatism’, in Rajeev Bhargava (ed), Politics, Ethics and the Self: Re-reading Gandhi’s Hind Swaraj, Oxon; Delhi: Routledge, 2022.", "Entry on ‘Ahimsa / Himsa / Satya / Asatya / Shanti', in Peter Ronald deSouza & Rukmini Bhaya Nair (eds), Indian Keywords Lexicon, London: Bloomsbury UK, 2020.", "‘Complexities in the Agency for Violence: A Look at the Mahabharata’ in Sibesh Chandra Bhattacharya, Vrinda Dalmiya & Gangeya Mukherji (eds), Exploring Agency in the Mahabharata: Ethical and Political Dimensions of Dharma, Oxon; Delhi: Routledge, 2018.", "‘Introduction: To Do’ with Vrinda Dalmiya in Sibesh Chandra Bhattacharya, Vrinda Dalmiya & Gangeya Mukherji (eds), Exploring Agency in the Mahabharata: Ethical and Political Dimensions of Dharma, Oxon; Delhi: Routledge, 2018.", "‘Introduction’ in Gangeya Mukherji (ed.), Learning Non-Violence, Delhi: Oxford University Press, 2016.", "‘Himsa-Ahimsa in the Mahabharata: The Lonely Position of Yudhishthira’ in Arindam Chakrabarti and Sibaji Bandyopadhyay (eds), Mahabharata Now: Narration, Aesthetics, Ethics, London; Delhi: Routledge, 2014.", "‘Reading King Lear: The Evil of Lying and the Perception of Truth’, in Shormistha Panja (ed.), Shakespeare and the Art of Lying, Delhi: Orient BlackSwan, 2013.", "‘Nehru and Later’, in Neelum Saran Gour (ed.), Allahabad: Where the Rivers Meet, Mumbai: Marg Publications, Vol. 61 No. 1, September 2009.", "‘Tagore as Public Intellectual’, in Shreesh Chaudhury et al (eds.), Reflections On English Studies: Essays In Memory of Shankarnand Palit, Darbhanga: Panchjanya Trust Pindarauch, 2009.", "Fifteen thousand-word essay entitled, \"Each One’s Gandhi: Critiquing, Enlisting, or Recording Gandhi’s Life\" [manuscript ID ENGHIS-2025-ART-089] submitted for consideration to The English Historical Review. Oxford: Oxford University Press. Peer Review report awaited.", "A selection of the writings of Mahatma Gandhi, comprising 500 pages and entitled Gandhi: A Contemporary Reader. The reader is broadly patterned on the two-volume, Essential Writings of Jawaharlal Nehru edited by S Gopal & Uma Iyengar. The manuscript is currently being finalised for Routledge.", "Monograph on the biographies of Gandhi. The manuscript is expected to be complete by June 2028.", "Monograph on Gandhi and the Bhagavadgita. Likely to be titled Gandhi’s Gospel, and expected to be completed by June 2027, around the centenary of Gandhi’s discourses on the Gita in the Satyagraha Ashram.", "Monograph on Yudhishthira and Dharma in the Mahabharata, likely to be completed by December 2030.", "‘Behind Tagore’s Response to the Poona Pact: Memory. Allegiance. Anxiety’, The Journal of Hindu Studies , Oxford: Oxford University Press. https://doi.org/10.1093/jhs/hiaf004", "‘Bhagavad Gita in Modern India’ with Sanjay Palshikar, Oxford Bibliographies in Hinduism .  Ed. Tracy Coleman. New York: Oxford University Press, 2019; Rev., 2025; URL:https://www.oxfordbibliographies.com/display/document/obo-9780195399318/obo-9780195399318-0229.xml?rskey=FxiPe6&result=26", "‘Gandhi: The Recognition of Political Temptation’, IIC Quarterly , New Delhi: India International Centre, vol. 46 Autumn 2019, Number 2, pp. 127-37.", "‘Vivekananda: The ethics of responsibility and the imagining of Modern India’, Occasional Paper: History and Society, New Series, 52, New Delhi: Nehru Memorial Museum and Library, 2014.", "‘Thinking Community and Nation: Relevance of Vivekananda’, IIC Quarterly , New Delhi: India International Centre, Summer 2012, vol. 39, Number 1, pp. 20-29.", "‘Open Texture of Nationalism: Tagore as Nationalist’, Rupkatha Journal: On Interdisciplinary Studies , [An Online open-access E-Journal, http://www. rupkatha.com/ .]; Special issue on Rabindranath Tagore, 150 Years, vol. 2, no. 4, November 2010, pp. 373-384.", "‘Gandhi: Non-Violence and Pragmatism’, Studies in Humanities and Social Sciences , Shimla: Indian Institute of Advanced Study, vol. XVI, nos. 1 & 2, 2009, pp. 95-117.", "‘Exploring NonViolence: A Seminar Report’, Economic & Political Weekly , Mumbai: Sameeksha Trust, vol. XLIV, no. 24, June 13-19, 2009, pp. 23-25.", "‘Tagore in the Context of Postcolonialism’, Sandhan , New Delhi: Centre for Studies In Civilizations, vol. VIII, no. 1 Jan-June 2008, pp. 27-93.", "‘Tagore: Transcending Post Colonial Attitudes’, Studies in Humanities and Social Sciences , Shimla: Indian Institute of Advanced Study, vol. XII, no. 2, Winter 2005, pp. 75-95.", "‘The Myriad Voices of the Indian Renaissance: Transmutation of the Regional to the Universal’, Studies in Humanities and Social Sciences , Shimla: Indian Institute of Advanced Study, vol. XI, no. 1, Summer 2004, pp. 93-120.", "‘A Philosophy for Disarmament?’, Seminar, New Delhi: Rameshraj Trust, 532 – December 2003.", "‘Synthesizing Modernity & Tradition: The Relevance of Vivekananda’, Studies in    Humanities and Social Sciences , Shimla: Indian Institute of Advanced Study, vol. VII, no. 2, 2000, pp. 83-107.", "‘Modern Indian Education and Human Values’, Mainstream , New Delhi: Perspective Publications Private Ltd., Annual, December 23, 2000, pp. 97-102.", "‘Vivekananda at the Time of Break-up of Nations’, Mainstream , New Delhi: Perspective Publications Private Ltd., Republic Day Special, vol. XXXVIII, no. 6, Jan 29, 2000, pp. 37-40.", "Gandhi: The End of Non-Violence ,Manash Firaq Bhattacharjee, Gurugram: Vintage, 2025, in Biblio: A Review of Books , New Delhi, Vol. 30, Nos. 7-9, July-September, 2025, p. 8. (forthcoming)", "Gandhi Turned Out to be “A True Mother and Father Combined”. CORRESPONDENCE BETWEEN GANDHI AND NILLA CRAM COOK: A YOUNG AMERICAN WOMAN IN INDIA, 1932-33 , Ed. & Intro, E.S. Reddy, Ahmedabad: Navjivan Publishing House, 2024, in The India Forum , July 2024. URL: https://www.theindiaforum.in/book-reviews/gandhis-american-disciple", "Elusive Non-Violence: The Making and Un making of Gandhi’s Religion of Ahimsa , by Jyotirmaya Sharma, Chennai: Context, 2021, in Biblio: A Review of Books , New Delhi, Vol. 27, Nos. 1-3, March-January, 2022, p. 16.", "M.K. Gandhi, An Autobiography or The Story of My Experiments with Truth , Critical Edition, Introduced with Notes by Tridip Suhrud,New Delhi: Penguin Books, 2018, in Seminar , New Delhi: Rameshraj Trust, 710 – October 2018, pp. 91-92.", "Two Saints: Speculations Around and About Ramakrishna Paramhamsa and Ramana Maharshi , by Arun Shourie,New Delhi: HarperCollins Publishers India, 2017, in Biblio: A Review of Books , New Delhi, Vol. XXXIII, Nos. 1-3, March-January, 2018, p. 30.", "The Decline of Civilization: Why We Need To Return To Gandhi and Tagore , by Ramin Jahanbegloo, New Delhi: Aleph Book Company, 2017, in Seminar , New Delhi: Rameshraj Trust, 702 – February 2018, pp. 72-73.", "Gandhi: An Impossible Possibility , by Sudhir Chandra, (trans) Chitra Padmanabhan,London: Routledge, 2017, in The Hindu , Chennai, 28 May 2017, p. 16.", "An Idealist in India: Selected Writings and Speeches of Sister Nivedita , by Amiya P. Sen,New Delhi: Primus Books, 2016, in The Book Review ,New Delhi: The Book Review Literary Trust, Vol. XLI, No: 3, March 2017, pp. 15-16.", "Evil and the Philosophies of Retribution: Modern Commentaries on the Bhagavad-Gita , by Sanjay Palshikar, Delhi: Routledge, 2014, in Seminar, New Delhi: Rameshraj Trust, 662 –October 2014, pp. 79-82.", "Mahatma Gandhi, Indian Home Rule [Hind Swaraj]: A Centenary Edition with an Introduction by S. R. Mehrotra, New Delhi & Chicago: Promilla & Co., Publishers in association with Bibliophile South Asia, 2010, in Summerhill: IIAS Review , Shimla: Indian Institute of Advanced Study, vol. XVI, No. 1, (Summer 2010), pp. 85-86.", "‘Statement of Outstanding Universal Value and Justification of Criteria’ as Consultant for the team preparing the Dossier for the Ministry of Culture, Government of India, for the nomination of Santiniketan as a UNESCO World Heritage Site in 2009.", "‘South Asian Philosophies of Peace: Tagore and Vivekananda’, as part of syllabi for the Nelson Mandela Center for Peace and Conflict Resolution, Jamia Millia Islamia, Delhi, 2009."], "research": []},
{"name": "Dipankar nagchoudhuri", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/dipankar-nagchoudhuri", "education": ["PhD (Electrical Engineering), Michigan State University, USA"], "email": "dnc@dau.ac.in", "phone": "079-68261654", "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "VLSI Design, CMOS Circuits and Technology, Biomedical Signal Processing Chip Design", "\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Dhaval joshi", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/dhaval-joshi", "education": ["Masters in Design (PGDPD): National Institute of Design, Gandhinagar"], "email": "dhaval_joshi@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Design Research, Artificial Intelligence, Gaming, Customer engagement", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Deepak ghodgaonkar", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/deepak-ghodgaonkar", "education": ["PhD (Electrical Engineering), University of Utah, USA"], "email": "deepak_ghodgaonkar@dau.ac.in", "phone": "079-68261623", "address": "# 1103, FB-1, DA-IICT, Gandhinagar, Gujarat, India – 382007", "faculty_web": "https://scholar.google.co.in/citations?user=CSK9tLMAAAAJ&hl=en&cstart=20&pagesize=20", "biography": ["Dr. Ghodgaonkar specialize in research areas of microwave nondestructive testing of composite materials and microwave imaging of human body. He has published more than 140 papers in reputed journal and conference proceedings. He supervised thesis work 4 PhD students and many MTech/BTech students. Also, he is a professor involved in teaching and research in areas of applied electromagnetics for more than 30 years. He has organized more than 14 international conferences. He is Senior Member IEEE, Fellow IETE and Fellow IEM, Malaysia."], "specialization": ["\n                    ", "\n          ", "RF and Microwave Engineering, Microwave Nondestructive Testing of Composite Materials, Biomedical Applications of Microwaves, Electromagnetic Imaging of Complex Dielectric Bodies, Microwave Measurements and Characterization of Nonlinear Dielectric Materials such as Barium-Strontium Titanate", "\n\n", "Meet Professor Deepak Ghodgaonkar has been a distinguished faculty member", "\n\n            \n                  "], "teaching": ["\n                    \n            ", "Microwave Engineering", "\n\t", "Antennas and Propagation", "\n\t", "Electromagnetic Fields and Waves", "\n\t", "Satellite Communications and Materials Science", "\n", "\n        \n                  "], "publications": ["Ch. V. N. Rao, D. K. Ghodgaonkar and Nitesh Sharma, “GaAs MMIC Low Noise Amplifier With Integrated High-Power Absorptive Receive Protection Switch” IEEE Microwave and Wireless Components Letters, Vol. 28, No. 12, December 2018, pp. 1128-1130, DOI: 10.1109/LMWC.2018.2877148", "R. J. Doshi and Deepak Ghodgaonkar, “Improving The Efficiency of Solid State Power Amplifier byfrequency Switching for Satellite Communication,” International Journal of Satellite Communications and Networking, July-August 2018, DOI:10.1002/sat.1254", "R. J. Doshi and Deepak Ghodgaonkar, “Adaptive Thermal Management Technique To Improve The Efficiency Of SSPA For Geosynchronous Satellite”, Journal of Heat Transfer, Volume 140, Issue 5, May, 2018.", "Hardik N. Patel and Deepak Ghodgaonkar, “Study of Effect of Numerical Breast Phantom Heterogeneity on Dielectric Profile Reconstruction Using Microwave Imaging” Progress In Electromagnetics Research M, Vol. 58, pp. 135-145, 2017.", "Hardik N. Patel and Deepak Ghodgaonkar, “Application of Group Theory for Computation Reduction in Microwave Imaging of Human Breast Model at 500 MHz” Progress In Electromagnetics Research M, Vol. 51, November 2016, pp. 165-173, 2016.", "Sanket S. Patel, Sanjeev Gupta and Deepak Ghodgaonkar, “Design of Low Power Low Phase Noise Negative Resistance KU-Band VCO using Planar Resonator Pair ” Microwave and Optical Technology Letters, Vol. 57, No. 8, August 2015, pp. 1938-1941.", "G. D. Makwana, Deepak Ghodgaonkar and Sanjeev Gupta, “Dual Mode and Miniaturized Rectangular Dielectric Resonator Antenna with a Simple Feeding Scheme” International Journal of RF and Microwave Computer Aided Engineering, Vol. 25, No. 3, March 2015, pp. 229-235.", "R. J. Doshi, Deepak Ghodgaonkar, D. K. Singh and D. K. Das, “Flexible Solid State Power Amplifier for Space Use,” International Journal of Microwave and Optical Technology, Vol. 10, No. 2, March 2015, pp. 126-131.", "G. D. Makwana, Deepak Ghodgaonkar and Sanjeev Gupta, “Investigation of a New Radiating Mode in Rectangular Dielectric Resonator Antenna: Experimental Validation,” International Journal of Microwave and Optical Technology, Volume 9 No. 4, July 2014, pp. 309-316.", "Ashish K. Sarvaiya, Sanjeev Gupta and Deepak Ghodgaonkar, “Interaction of Active MMIC with Package/Housing,” Advanced Electromagnetics, Vol. 3, No. 1, April 2014, pp. 25-29."], "research": []},
{"name": "Binay bhushan chakrabarti", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/binay-bhushan-chakrabarti", "education": ["PhD (Economics), Jadavpur University Calcutta"], "email": "binaybhushan_chakrabarti@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Finance", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Anjan ghosh", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/anjan-ghosh", "education": ["PhD (Electrical Engineering), Carnegie Mellon University, Pittsburgh, Pennsylvania"], "email": "anjan_ghosh@dau.ac.in", "phone": "079-68261645", "address": "# 1111, FB-1, DA-IICT, Gandhinagar, Gujarat, India – 382007", "faculty_web": null, "biography": ["Dr. Anjan K Ghosh has 35 years of research and teaching experience in the areas of optical information processing, optical communications and photonic sensors. He obtained his PhD in Electrical Eng. in 1984 from Carnegie-Mellon Univ., Pittsburgh and his MS from the SUNY at Stony Brook. He is an alumnus of IIT Kharagpur, India. At present, he is a Professor in DA-IICT, Gandhinagar, India. Dr. Ghosh was a member of technical staff in AT&T Bell Laboratories for 2 years. Then he served as a faculty member in the Univ. of Iowa, Iowa City, USA, IIT Kanpur, India, Nanyang Tech. Univ., Singapore, the University of Oklahoma, Tulsa, USA and DA-IICT, Gandhinagar, India. Dr. Ghosh has served as the Vice Chancellor of Tripura (Central) University in Agartala, Tripura, India for 5.5 years. He was the Head of the Dept. of Electrical Eng., Adv. Center for Electronic Sciences, Laser Tech. Program and the Center for Laser Tech., all at IIT Kanpur. He published over 160 papers in journals and conference proceedings and delivered several invited talks. He is a Senior Member of IEEE, a fellow of the IETE(India), IE (India), and the Optical Soc. of India and a member of SPIE, and OSA. He is also a member of the honor societies: Eta-Kappa-Nu and Sigma-Xi in USA."], "specialization": ["\n                    ", "\n          ", "Optical Communication - Fiber Optic and Free Space, Photonic Devices and Subsystems, Sensors, Image and Signal Processing, Nonlinear Systems and Chaos, System Dynamics Modelling of Education", "\n            \n                  "], "teaching": ["\n                    \n            ", "Optical Communication", "\n\t", "Optical Wireless Communication", "\n\t", "Basic Electronics", "\n\t", "Linear Algebra", "\n\t", "Random Variables and Processes", "\n", "\n        \n                  "], "publications": ["U Gogoi, M Bhowmik, D Bhattacharjee, and A Ghosh, “Singular Value based Characterization and Analysis of Thermal Patches for Early Breast Abnormality Detection”, Australasian Physical and Engineering Science in Medicine, Springer , pp. 1-19, 2018, https://doi.org/10.1007/s13246-018-0681-4.", "A. Datta, A. Ghosh and A. Mukherjee, “Characterization of Chaotic electro optic modulator with the help of Lypunov exponent and bifurcation analysis technique”, Materials Today: Proceedings, Vol. 5, pp. 20131-2039, 2018.", "T. Deb, A. Ghosh and A. Mukherjee, “Singular value decomposition applied to associative memory of Hopfield neural networks”, Materials Today: Proceedings, Vol. 5, pp. 2222-2228, 2018.", "M. Bhowmick, U. Gogoi, G. Majumdar, D. Bhattacharjee, S. Datta and A. Ghosh, “Designing of Ground Truth Annotated DBT-TU-JU Thermogram Database towards Early Abnormality Prediction” to appear in IEEE Journal of Biomedical and Health Informatics, 2018. doi: 10.1109/JBHI 2017.2740500.", "D. Shah, D. Kothari and A. Ghosh, “Bit Error Rate Analysis of the K Channel using Wavelength Diversity”, Optical Engineering, Vol. 56, p. 056106, May 2017. doi: 10.1117/1.OE.56.5.056106.", "A. Ghosh and Anasmita Ghosh, “A few ways of reducing cheating in examinations in Indian colleges and universities”, University News, Vol. 55, No. 05, pp. 164-168, Jan. 30-Feb. 05, 2017.", "M. Bhowmick, U. Gogoi, G. Majumdar, D. Bhattacharjee, S. Datta and A. Ghosh, “Designing of Ground Truth Annotated DBT-TU-JU Thermogram Database towards Early Abnormality Prediction” to appear in IEEE Journal of Biomedical and Health Informatics, 2018. doi: 10.1109/JBHI 2017.2740500 .", "T. Deb, A. Ghosh and A. Mukherjee, “Singular value decomposition applied to associative memory of Hopfield neural networks”, Materials Today : Proceedings, Vol. 5, pp. 2222-2228, 2018 .", "A. Datta, A. Ghosh and A. Mukherjee, “Characterization of Chaotic electro optic modulator with the help of Lypunov exponent and bifurcation analysis technique”, Materials Today : Proceedings, Vol. 5, pp. 20131-2039, 2018 .", "U Gogoi, M Bhowmik, D Bhattacharjee, and A Ghosh, “Singular Value based Characterization and Analysis of Thermal Patches for Early Breast Abnormality Detection”, Australasian Physical and Engineering Science in Medicine, Springer , pp. 1-19, 2018, https://doi.org/10.1007/s13246-018-0681-4 .", "A. Ghosh, A. Datta and A. Mukherjee, “ Noise Tolerance in Optical Chaos Encrypted Communication Using Nonlinear Electro-optic Systems”, Proc. Photonics-2018 The Intl. Conference on Fiber Optics and Photonics, Dec 2018 , New Delhi (Abstract only)."], "research": []},
{"name": "Amishal modi ", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/amishal-modi", "education": ["PhD (English), Gujarat University "], "email": "amishal_modi@dau.ac.in", "phone": "079-68261594", "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Indian Literature, The English Novel, Sexuality Studies, 19th Century Literature", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Ajeet kumar singh", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/ajeet-kumar-singh", "education": ["MS by Research in Computer Science and Engineering"], "email": "ajeetkumar_singh@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Computer Vision, Natural Language Processing, Adversarial Machine Learning", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Aditi nath sarkar", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/aditinath-sarkar", "education": ["MA (South Asian Languages and Civilizations), University of Chicago, USA"], "email": "aditinath_sarkar@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Literature, Religious, Cultural History; South Asian Civilization Studies", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []},
{"name": "Abhijit mukherjee", "profile_url": "https://www.daiict.ac.in/adjunct-faculty/abhijit-mukherjee", "education": ["MBA in Systems from Vinayaka Mission University"], "email": "abhijit_mukherjee@dau.ac.in", "phone": null, "address": null, "faculty_web": null, "biography": [], "specialization": ["\n                    ", "\n          ", "Enterprise Computing and SAP Systems (IS-U, S/4 HANA), Data Privacy and Compliance (DPDP Act 2023), IT Strategy, Governance, and Data Analytics", "\n\n            \n                  "], "teaching": [], "publications": [], "research": []}
]